; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v2 - type_2 ?v4 - type_3)
 	      (pred_3 ?v1 - object ?v4 - type_3)
	      (pred_4 ?v2 - type_2 ?v8 - type_1)
	      (pred_2 ?v2 - type_2 ?v1 - object ?v8 - type_1))

   (:action op_1
       :parameters  (?v2 - type_2 ?v6 ?v5 - type_3)
       :precondition (and  (pred_1 ?v2 ?v6))
       :effect (and  (pred_1 ?v2 ?v5)
		     (not (pred_1 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_2 ?v3 - object ?v7 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v7) (pred_1 ?v2 ?v7) (pred_4 ?v2 ?v8))
       :effect (and (pred_2 ?v2 ?v3 ?v8)
		    (not (pred_3 ?v3 ?v7)) 
		    (not (pred_4 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_2 ?v3 - object ?v7 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v3 ?v8) (pred_1 ?v2 ?v7))
       :effect (and (pred_3 ?v3 ?v7)
		    (pred_4 ?v2 ?v8)
		    (not (pred_2 ?v2 ?v3 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_10 - type_2
obj_03 obj_04 - type_1
obj_09 obj_06 obj_07 obj_08 - type_3
obj_01 obj_05 obj_02 - object)
(:init
(pred_1 obj_10 obj_09)
(pred_4 obj_10 obj_03)
(pred_4 obj_10 obj_04)
(pred_3 obj_01 obj_08)
(pred_3 obj_05 obj_09)
(pred_3 obj_02 obj_07)
)
(:goal
(and
(pred_3 obj_01 obj_08)
(pred_3 obj_05 obj_07)
(pred_3 obj_02 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_10 ?b obj_04))))
)
)

; plan
1. (op_2 obj_10 obj_05 obj_09 obj_03)
   deleted: (pred_3 obj_05 obj_09) (pred_4 obj_10 obj_03)
   added: (pred_2 obj_10 obj_05 obj_03)
   goals met: 1 of 3
2. (op_1 obj_10 obj_09 obj_07)
   deleted: (pred_1 obj_10 obj_09)
   added: (pred_1 obj_10 obj_07)
   goals met: 1 of 3
3. (op_3 obj_10 obj_05 obj_07 obj_03)
   deleted: (pred_2 obj_10 obj_05 obj_03)
   added: (pred_3 obj_05 obj_07) (pred_4 obj_10 obj_03)
   goals met: 2 of 3
4. (op_2 obj_10 obj_02 obj_07 obj_03)
   deleted: (pred_3 obj_02 obj_07) (pred_4 obj_10 obj_03)
   added: (pred_2 obj_10 obj_02 obj_03)
   goals met: 2 of 3
5. (op_1 obj_10 obj_07 obj_08)
   deleted: (pred_1 obj_10 obj_07)
   added: (pred_1 obj_10 obj_08)
   goals met: 2 of 3
6. (op_3 obj_10 obj_02 obj_08 obj_03)
   deleted: (pred_2 obj_10 obj_02 obj_03)
   added: (pred_3 obj_02 obj_08) (pred_4 obj_10 obj_03)
   goals met: 3 of 3
